Revit.Elements.Views.DraftingView
A Revit ViewDrafting

Revit.Elements.Views.DraftingView.#ctor(Autodesk.Revit.DB.ViewDrafting)
Private constructor

Revit.Elements.Views.DraftingView.#ctor(System.String)
Private constructor

Revit.Elements.Views.DraftingView.InitDraftingView(Autodesk.Revit.DB.ViewDrafting)
Initialize a DraftingView element

Revit.Elements.Views.DraftingView.InitDraftingView(System.String)
Initialize a DraftingView element

Revit.Elements.Views.DraftingView.InternalSetDraftingView(Autodesk.Revit.DB.ViewDrafting)
Set the InternalViewDrafting property and the associated element id and unique id
floor:

Revit.Elements.Views.DraftingView.ByName(System.String)
Create a Revit DraftingView given it's name
name: Name of the view
Returns: The view

Revit.Elements.Views.DraftingView.FromExisting(Autodesk.Revit.DB.ViewDrafting,System.Boolean)
Create a View from a user selected Element.
view:
isRevitOwned:
Returns:

Revit.Elements.Views.DraftingView.InternalViewDrafting
An internal handle on the Revit element

Revit.Elements.Views.DraftingView.InternalElement
Reference to the Element